public class Main {

    public static void main(String[] args) {
        String txt = "Погляньте коли на кота, що сидить перед вами, коли він куражніший коли? " +
                "Коли ж... Тоді, коли- всю ніч \"бродить #або сидить біля нори, хоча, зловивши, й не їсть миші. " +
                "Замкни в достатку- бджолу, чи \"не помре з туги, в той час, коли можна- їй літати по квітоносних лугах? " +
                "Коли гірше, ніж купатися в достатку і смертельно каратися без: природженого діла?";
        Text text = new Text(txt);
        Text sent = new Text("коли");
        Text.exercise(text, sent.getSentences()[0].getWord());
    }
}